tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"

brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

brew 'coreutils'
brew 'findutils'
brew 'bash'
brew 'grep'
brew 'wget'
brew 'curl'
brew 'git'
brew 'git-extras'
brew 'python'
brew 'ansible'
brew 'vim'
brew 'watch'
brew 'mas'
brew 'unrar'
brew 'awscli'
brew 'node'
brew 'jq'
brew 'rclone'
brew 'ffmpeg'
brew 'lame'
brew 'mpv'
brew 'packer'
brew 'youtube-dl'
brew 'gradle'
brew 'pwgen'
brew 'livestreamer'

# Clean reinstallation of system
cask_args appdir: '/Applications'
cask 'aerial'
cask 'alfred'
cask 'apache-directory-studio'
cask 'appcleaner'
cask 'dash'
cask 'dashlane'
cask 'deckset'
cask 'docker'
cask 'dropbox'
cask 'ferdi'
cask 'firefox'
cask 'fromscratch'
cask 'google-drive-file-stream'
cask 'google-chrome-canary'
cask 'google-chrome'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'keybase'
cask 'kid3'
cask 'loopback'
cask 'macdown'
cask 'native-access'
cask 'path-finder'
cask 'postman'
cask 'sequel-pro'
cask 'skype'
cask 'sony-ps4-remote-play'
cask 'spotify'
cask 'switch'
cask 'the-unarchiver'
cask 'transmission'
cask 'textmate'
cask 'tweetbot'
cask 'virtualbox'
cask 'vivaldi'
cask 'vlc'
cask 'whatsapp'
cask 'yubico-yubikey-manager'

# Mac App Store installs
mas 'WiFi Explorer', id:494803304

# No longer using this
#cask 'slack'
#cask 'soulver'

# manual installs
# MixedInKey: https://account.mixedinkey.com/recovery
